'''6. Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
практических и лабораторных занятий по этому предмету и их количество.
Важно, чтобы для каждого предмета не обязательно были все типы занятий.
Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести словарь на экран.
Примеры строк файла:
Информатика: 100(л) 50(пр) 20(лаб).
Физика: 30(л) — 10(лаб)
Физкультура: — 30(пр) —
Пример словаря:
{“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}'''

result={}
with open('file_task6','r') as file:
    text=file.readlines()
    for i in text:
        middle=''
        title=i.split(':')[0]
        n=0
        for y in i:
            n+=1
            if y.isdigit():
                middle+=y
                if not i[n].isdigit():
                    middle+=' '
        result.update([(title,sum([int(x) for x in middle.split()]))])
print(result)