'''1. Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск).
Атрибут реализовать как приватный. В рамках метода реализовать переключение светофора в режимы: красный, желтый, зеленый.
Продолжительность первого состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды, третьего (зеленый) — на ваше усмотрение.
Переключение между режимами должно осуществляться только в указанном порядке (красный, желтый, зеленый). Проверить работу примера,
создав экземпляр и вызвав описанный метод.
Задачу можно усложнить, реализовав проверку порядка режимов, и при его нарушении выводить соответствующее сообщение и завершать скрипт.'''

import time
class TrafficLight:
        __color='Красный'
        def running(self):
            assert TrafficLight.__color=='Красный', 'Неправильный цвет, должен быть красный'
            print(TrafficLight.__color)
            time.sleep(7)
            TrafficLight.__color='Желтый'
            assert TrafficLight.__color=='Желтый', 'Неправильный цвет, должен быть желтый'
            print(TrafficLight.__color)
            time.sleep(2)
            TrafficLight.__color='Зеленый'
            assert TrafficLight.__color=='Зеленый', 'Неправильный цвет, должен быть зеленый'
            print(TrafficLight.__color)
            time.sleep(5)
            TrafficLight.__color='Красный'
s = TrafficLight()
while True:
    s.running()